{
  "developmentExperience": [
    {
      "title": "Java Developer - Cloud",
      "dateRange": "November 2016 - Present",
      "employer": "Scotiabank",
      "languages": ["Java"],
      "technologies": [
        "Spring",
        "Pivotal Cloud Foundry",
        "Microsoft Azure"
      ],
      "accomplishments": [
        "Successfully deployed secure instances of Pivotal Cloud Foundry PaaS to the public cloud in Microsoft Azure for production use",
        "Created a three-day training program for other developers within ScotiaBank and provided training for over 50 developers",
        "Implemented onboarding and maintenance tools to allow developers to onboard and deploy applications within minutes",
        "Implemented Banking as a Service API platform microservices to deliver banking functionality to software initiatives in Chile",
        "Continually raised the bar for code quality and test adequacy requirements"
      ]
    },
    {
      "title": "Senior Software Developer",
      "dateRange": "April 2016 - November 2016",
      "employer": "Armstrong Fluid Technology",
      "languages": [
        "C#",
        "HTML",
        "JavaScript"
      ],
      "technologies": [
        "ASP.NET Web API",
        "AngularJS",
        "SCSS"
      ],
      "accomplishments": [
        "Proposed foundational architectural changes including technology stack updates and transitioning to microservices",
        "Designed and led a team of 5 - 6 developers to successfully implement proof of concept for integration of third party configurator software",
        "Providing architectural and technical guidance on full implementation of integration of several third party software packages",
        "Championed adoption of scrum process within the development team and coached the team in adopting industry best practices"
      ]
    },
    {
      "title": "Intermediate Software Developer",
      "dateRange": "December 2014 - March 2016",
      "employer": "Armstrong Fluid Technology",
      "languages": [
        "C#",
        "HTML",
        "JavaScript"
      ],
      "technologies": [
        "ASP.NET MVC",
        "jQuery",
        "LESS"
      ],
      "accomplishments": [
        "Designed and led a team of 3 - 4 developers to successfully implement product upselling mechanism",
        "Designed and implemented a replacement for a highly-customized table user interface element"
      ]
    },
    {
      "title": "Software Developer",
      "dateRange": "December 2011 - October 2014",
      "employer": "SeisWare International Inc.",
      "languages": [
        "C#",
        "C++",
        "Fortran"
      ],
      "technologies": [
        "WinForms",
        ".NET 4.0",
        "Crucible"
      ],
      "accomplishments": [
        "Integrated and improved third party processing product leading to substantial revenue",
        "Assisted in upgrading SeisWare to a multi-user application for enterprise environments",
        "Was a key proponent of implementing code reviews throughout the development team"
      ]
    },
    {
      "title": "Intermediate Software Developer",
      "dateRange": "May 2010 - December 2011",
      "employer": "Circle Cardiovascular Imaging Inc.",
      "languages": [
        "C++",
        "Java EE",
		"JavaScript"
      ],
      "technologies": [
        "QT",
        "OpenGL",
        "AJAX (jQuery)"
      ],
      "accomplishments": [
        "Managed the complexity of DICOM integration by abstracting implementation details from API",
        "Developed a 2D rendering framework which was more flexible and an order of magnitude faster",
        "Designed and implemented a secure pay per use system which adheres to patient privacy regulations"
      ]
    },
    {
      "title": "Software Developer",
      "dateRange": "August 2008 - May 2010",
      "employer": "inUnison Technology Services Ltd.",
      "languages": [
        "C#",
        "T-SQL",
		"Classic ASP"
      ],
      "technologies": [
        "ASP.NET",
        "SSRS",
        "SSIS"
      ],
      "accomplishments": [
        "Designed and began implementing a long term plan to upgrade their member authentication solution",
        "Created and configured a full 3-tier development environment using available hardware",
        "Maintained over 60 internal applications and over 300 reports within a very small team"
      ]
    },
    {
      "title": "Software Development and Testing Intern",
      "dateRange": "May 2006 - August 2007",
      "employer": "Calgary Scientific Inc.",
      "languages": [
        "C++"
      ],
      "technologies": [
        "QT",
        "OpenGL"
      ],
      "accomplishments": [
        "Developed a replacement for obsolete data loading and communication libraries",
        "Was involved in the redesign process for the flagship ResolutionMD product"
      ]
    }
  ],
  "unrelatedExperience": [
    {
      "title": "University Course Lab Designer",
      "dateRange": "May 2008 - August 2008",
      "employer": "Dr. Vahid Garousi, University of Calgary",
      "responsibilities": [
		"Planned, prepared, and documented labs for SENG 521 - Software Reliability and Testing",
		"Labs included topics: regression testing, unit testing, mutation testing, and test plan adequacy criteria"
	  ],
      "accomplishments": [
        "The lab materials were well received, and were in use for three years of the course"
      ]
    },
    {
      "title": "Non-Commissioned Member",
      "dateRange": "July 2004 - March 2007",
      "employer": "Canadian Armed Forces, 33 Field Engineers Squadron",
      "responsibilities": [
		"Primary role of field engineers is to provide friendly troops with the ability to live, move, and fight while denying those abilities to the enemy",
		"Secondary role of field engineers is to supplement infantry forces"
	  ],
      "accomplishments": [
        "Held the ranks of Private, Sapper, and Corporal before resigning to focus on my civilian career"
      ]
    }
  ]
}